//модуль "тестирования" символов
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
#define MAX_SIZE 100 //максимальное количество элементов массива

//------------------------------------------------------------------------------
//функция "тестирования" символов
//sim - строка, содержащяя префиксную запись выражения (если num==1)
                         //или переменные со значением (если num==2)
//kol_sim - количество символов в "sim"
int TestSimbols(int num, char sim[MAX_SIZE], int kol_sim)
{
  int i, j, //счётчики
      kol1, //количество символов "("
      kol2; //количество символов ")"
  j=0;
  switch (num)
  {
    //"тестирование" 1 строки символов из файла "expression.txt"
    case 1:
      for (i=0;i<kol_sim;i++)
        //недопустимый символ
        if (((sim[i]<97) | (sim[i]>122)) & ((sim[i]!='+') & (sim[i]!='-') &
          (sim[i]!='*') & (sim[i]!='/') & (sim[i]!='^') & (sim[i]!='(') &
            (sim[i]!=')') & (sim[i]!='3')))
            {
              printf("\nНедопустимый символ: \"%c\"(#%i)", sim[i], i);
              j++;
            }
      if (j>0)
      {
        getch();
        exit(1);
      }
      kol1=kol2=0;
      for (i=0;i<kol_sim;i++)
      {
        if (sim[i]=='(')
          kol1++;
        if (sim[i]==')')
          kol2++;
      }
      //количество символов "(" неравно количеству символов ")"
      if (kol1!=kol2)
      {
        printf("\nКоличество символов \"(\"(%i) неравно количеству символов \")\"(%i)", kol1, kol2);
        getch();
        exit(1);
      }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за латинской буквой
        if (((sim[i]>=97) & (sim[i]<=122)) & (((sim[i+1]<97) | (sim[i+1]>122)) &
          (sim[i+1]!='+') & (sim[i+1]!='-') & (sim[i+1]!='*') & (sim[i+1]!='/') &
            (sim[i+1]!='^') & (sim[i+1]!=')') & (sim[i+1]!='(') & (sim[i+1]!='3')))
            {
              printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
              getch();
              exit(1);
            }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за математической операцией
        if (((sim[i]=='+') | (sim[i]=='-') | (sim[i]=='*') | (sim[i]=='/') |
          (sim[i]=='^')) & ((sim[i+1]<97) | (sim[i+1]>122)) & (sim[i+1]!='('))
          {
            printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
            getch();
            exit(1);
          }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за символом "("
        if ((sim[i]=='(') & ((sim[i+1]<97) | (sim[i+1]>122)) & (sim[i+1]!='('))
        {
          printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
          getch();
          exit(1);
        }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за символом ")"
        if ((sim[i]==')') & (sim[i+1]!='+') & (sim[i+1]!='-') & (sim[i+1]!='*') &
          (sim[i+1]!='/') & (sim[i+1]!='^') & (sim[i+1]!=')'))
          {
            printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
            getch();
            exit(1);
          }
    break;
    //==========================================================================
    //"тестирование" символов из файла "expression.txt" (со 2 строки)
    case 2:
      for (i=0;i<kol_sim;i++)
        //
        if (((sim[i]<97) | (sim[i]>122)) & ((sim[i]<48) | (sim[i]>57)) &
          (sim[i]!='-') & (sim[i]!='=') & (sim[i]!='.') & (sim[i]!=' '))
          {
            printf("\nНедопустимый символ: \"%c\"(#%i)", sim[i], i);
            j++;
          }
      if (j>0)
      {
        getch();
        exit(1);
      }
      if ((sim[0]<97) | (sim[i]>122))
      {
        printf("\nUnknown first simbol: \"%c\"(#%i) (not a..z)", sim[0], 0);  
        getch();
        exit(1);
      }
      if ((sim[kol_sim-1]<48) | (sim[kol_sim-1]>57))
      {
        printf("\nUnknown last simbol: \"%c\"(#%i) (not 0..9)", sim[kol_sim-1], kol_sim-1);  
        getch();
        exit(1);
      }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за латинской буквой
        if (((sim[i]>=97) & (sim[i]<=122)) & (sim[i+1]!='='))
        {
          printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
          getch();
          exit(1);
        }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за символом "="
        if ((sim[i]=='=') & ((sim[i+1]<48) | (sim[i+1]>57)) & (sim[i+1]!='-'))
        {
          printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
          getch();
          exit(1);
        }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за цифрой
        if (((sim[i]>=48) & (sim[i]<=57)) & ((sim[i+1]<48) | (sim[i+1]>57)) &
          (sim[i+1]!='.') & ((sim[i+1]<97) | (sim[i+1]>122)))
          {
            printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
            getch();
            exit(1);
          }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за символом "."
        if ((sim[i]=='.') & ((sim[i+1]<48) | (sim[i+1]>57)))
        {
          printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
          getch();
          exit(1);
        }
      for (i=0;i<kol_sim-1;i++)
        //проверка допстимых символов, следующих за символом "-"
        if ((sim[i]=='-') & ((sim[i+1]<48) | (sim[i+1]>57)))
        {
          printf("\nНедопустимое сочетание символов: \"%c%c\"(#%i, #%i)", sim[i], sim[i+1], i, i+1);
          getch();
          exit(1);
        }
      break;
    default:
      printf("\nОшибка: TestSimbols(int num, char sim[MAX_SIZE], int kol_sim)");
  }
  return 0;
}
